Applying:

```
data.google_client_config.default: Reading...
data.google_container_cluster.play_grafana: Reading...
data.google_client_config.default: Read complete after 0s [id=projects/raintank-dev/regions/us-central1/zones/]
data.google_container_cluster.play_grafana: Read complete after 1s [id=projects/raintank-dev/locations/us-central1/clusters/raintank-dev-play-grafana-gke]
module.elasticstack.kubernetes_service.service_elasticsearch: Refreshing state... [id=play-backends/elasticsearch]
module.elasticstack.kubernetes_service.service_kibana: Refreshing state... [id=play-backends/kibana]
module.k6-test.kubernetes_service_account_v1.service_account_k6: Refreshing state... [id=play-backends/test-k6-io]
module.influxdb.kubernetes_deployment.deployment_influxdb: Refreshing state... [id=play-backends/influxdb]
module.elasticstack.kubernetes_config_map_v1.kibana-configmap: Refreshing state... [id=play-backends/kibana-configmap]
module.influxdb.kubernetes_service.service_influxdb: Refreshing state... [id=play-backends/influxdb]
module.postgres.kubernetes_service.service_postgresdb: Refreshing state... [id=play-backends/postgresdb]
module.influxdb.kubernetes_ingress_v1.ingress_influx: Refreshing state... [id=play-backends/influxdb]
module.k6-test.kubernetes_service.service_k6test: Refreshing state... [id=play-backends/test-k6-io]
module.k6-test.kubernetes_ingress_v1.ingress_k6test: Refreshing state... [id=play-backends/test-k6-io]
module.k6-test.kubernetes_deployment.deployment_k6test: Refreshing state... [id=play-backends/test-k6-io]
module.httpbin.kubernetes_service.service_httpbin: Refreshing state... [id=play-backends/httpbin]
module.httpbin.kubernetes_deployment.deployment_httpbin: Refreshing state... [id=play-backends/httpbin]
module.clickhouse.kubernetes_ingress_v1.ingress_clickhouse: Refreshing state... [id=play-backends/clickhouse]
module.httpbin.kubernetes_ingress_v1.ingress_httpbin: Refreshing state... [id=play-backends/httpbin]
module.elasticstack.kubernetes_deployment.deployment_elasticsearch: Refreshing state... [id=play-backends/elasticsearch]
module.mysql.kubernetes_service.service_mysql: Refreshing state... [id=play-backends/mysql]
module.clickhouse.kubernetes_deployment.deployment_clickhouse: Refreshing state... [id=play-backends/clickhouse]
module.redis.kubernetes_deployment.deployment_redis: Refreshing state... [id=play-backends/redis]
module.mysql.kubernetes_config_map_v1.mysql-configmap: Refreshing state... [id=play-backends/mysql-setup]
module.mysql.kubernetes_deployment.deployment_mysql: Refreshing state... [id=play-backends/mysql]
module.opentsdb.kubernetes_deployment.deployment_opentsdb: Refreshing state... [id=play-backends/opentsdb]
module.clickhouse.kubernetes_service.service_clickhouse: Refreshing state... [id=play-backends/clickhouse]
module.elasticstack.kubernetes_ingress_v1.ingress_kibana: Refreshing state... [id=play-backends/kibana]
module.postgres.kubernetes_deployment.deployment_postgresdb: Refreshing state... [id=play-backends/postgresdb]
module.influxdb.kubernetes_config_map_v1.influxdb-configmap: Refreshing state... [id=play-backends/influxdb-configmap]
module.elasticstack.kubernetes_ingress_v1.ingress_elastic: Refreshing state... [id=play-backends/elastic]
module.opentsdb.kubernetes_ingress_v1.ingress_opentsdb: Refreshing state... [id=play-backends/opentsdb]
module.redis.kubernetes_service.service_redis: Refreshing state... [id=play-backends/redis]
module.opentsdb.kubernetes_service.service_opentsdb: Refreshing state... [id=play-backends/opentsdb]
module.elasticstack.kubernetes_manifest.deployment_kibana: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.httpbin.kubernetes_deployment.deployment_httpbin will be destroyed
  # (because kubernetes_deployment.deployment_httpbin is not in configuration)
  - resource "kubernetes_deployment" "deployment_httpbin" {
      - id               = "play-backends/httpbin" -> null
      - wait_for_rollout = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 2 -> null
          - labels           = {
              - "app" = "httpbin"
            } -> null
          - name             = "httpbin" -> null
          - namespace        = "play-backends" -> null
          - resource_version = "76181511" -> null
          - uid              = "af67b282-059d-4669-80ff-1137c08822ba" -> null
        }

      - spec {
          - min_ready_seconds         = 0 -> null
          - paused                    = false -> null
          - progress_deadline_seconds = 600 -> null
          - replicas                  = "2" -> null
          - revision_history_limit    = 10 -> null

          - selector {
              - match_labels = {
                  - "app" = "httpbin"
                } -> null
            }

          - strategy {
              - type = "Recreate" -> null
            }

          - template {
              - metadata {
                  - annotations = {} -> null
                  - generation  = 0 -> null
                  - labels      = {
                      - "app" = "httpbin"
                    } -> null
                }
              - spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = true -> null
                  - dns_policy                       = "ClusterFirst" -> null
                  - enable_service_links             = true -> null
                  - host_ipc                         = false -> null
                  - host_network                     = false -> null
                  - host_pid                         = false -> null
                  - node_selector                    = {} -> null
                  - restart_policy                   = "Always" -> null
                  - scheduler_name                   = "default-scheduler" -> null
                  - service_account_name             = "test-k6-io" -> null
                  - share_process_namespace          = false -> null
                  - termination_grace_period_seconds = 30 -> null

                  - container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      - image                      = "grafana/k6-httpbin:v0.7.3" -> null
                      - image_pull_policy          = "IfNotPresent" -> null
                      - name                       = "httpbin" -> null
                      - stdin                      = false -> null
                      - stdin_once                 = false -> null
                      - termination_message_path   = "/dev/termination-log" -> null
                      - termination_message_policy = "File" -> null
                      - tty                        = false -> null

                      - liveness_probe {
                          - failure_threshold     = 6 -> null
                          - initial_delay_seconds = 0 -> null
                          - period_seconds        = 10 -> null
                          - success_threshold     = 1 -> null
                          - timeout_seconds       = 5 -> null

                          - http_get {
                              - path   = "/" -> null
                              - port   = "8080" -> null
                              - scheme = "HTTP" -> null
                            }
                        }

                      - port {
                          - container_port = 8080 -> null
                          - host_port      = 0 -> null
                          - name           = "http" -> null
                          - protocol       = "TCP" -> null
                        }

                      - readiness_probe {
                          - failure_threshold     = 3 -> null
                          - initial_delay_seconds = 5 -> null
                          - period_seconds        = 5 -> null
                          - success_threshold     = 1 -> null
                          - timeout_seconds       = 3 -> null

                          - http_get {
                              - path   = "/" -> null
                              - port   = "8080" -> null
                              - scheme = "HTTP" -> null
                            }
                        }

                      - resources {
                          - limits   = {
                              - "cpu"    = "350m"
                              - "memory" = "96Mi"
                            } -> null
                          - requests = {
                              - "cpu"    = "250m"
                              - "memory" = "64Mi"
                            } -> null
                        }

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = true -> null
                          - run_as_user                = "1000" -> null

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }
                    }

                  - image_pull_secrets {
                      - name = "dockerhub" -> null
                    }
                }
            }
        }
    }

  # module.httpbin.kubernetes_ingress_v1.ingress_httpbin will be destroyed
  # (because kubernetes_ingress_v1.ingress_httpbin is not in configuration)
  - resource "kubernetes_ingress_v1" "ingress_httpbin" {
      - id     = "play-backends/httpbin" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = ""
                              - ip       = "34.133.192.185"
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "httpbin" -> null
          - namespace        = "play-backends" -> null
          - resource_version = "75502330" -> null
          - uid              = "e29c8096-78a6-472a-8f57-84f52a5d247e" -> null
        }

      - spec {
          - ingress_class_name = "nginx" -> null

          - rule {
              - host = "k6-bin.grafana.fun" -> null

              - http {
                  - path {
                      - path      = "/" -> null
                      - path_type = "Prefix" -> null

                      - backend {
                          - service {
                              - name = "httpbin" -> null

                              - port {
                                  - number = 8080 -> null
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.httpbin.kubernetes_service.service_httpbin will be destroyed
  # (because kubernetes_service.service_httpbin is not in configuration)
  - resource "kubernetes_service" "service_httpbin" {
      - id                     = "play-backends/httpbin" -> null
      - status                 = [
          - {
              - load_balancer = [
                  - {
                      - ingress = []
                    },
                ]
            },
        ] -> null
      - wait_for_load_balancer = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {
              - "app" = "httpbin"
            } -> null
          - name             = "httpbin" -> null
          - namespace        = "play-backends" -> null
          - resource_version = "75502325" -> null
          - uid              = "2df4e8b0-b0f3-4950-a75e-0b57b0894b4f" -> null
        }

      - spec {
          - allocate_load_balancer_node_ports = true -> null
          - cluster_ip                        = "10.7.251.83" -> null
          - cluster_ips                       = [
              - "10.7.251.83",
            ] -> null
          - external_ips                      = [] -> null
          - health_check_node_port            = 0 -> null
          - internal_traffic_policy           = "Cluster" -> null
          - ip_families                       = [
              - "IPv4",
            ] -> null
          - ip_family_policy                  = "SingleStack" -> null
          - load_balancer_source_ranges       = [] -> null
          - publish_not_ready_addresses       = false -> null
          - selector                          = {
              - "app" = "httpbin"
            } -> null
          - session_affinity                  = "None" -> null
          - type                              = "ClusterIP" -> null

          - port {
              - node_port   = 0 -> null
              - port        = 8080 -> null
              - protocol    = "TCP" -> null
              - target_port = "8080" -> null
            }
        }
    }

  # module.k6-bin.kubernetes_deployment.deployment_k6test will be created
  + resource "kubernetes_deployment" "deployment_k6test" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "k6-php"
            }
          + name             = "k6-php"
          + namespace        = "play-backends"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "2"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "k6-php"
                }
            }

          + strategy {
              + type = "Recreate"
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "k6-php"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = "k6-php"
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "grafana/test.k6.io:v0.0.3"
                      + image_pull_policy          = "IfNotPresent"
                      + name                       = "k6-php"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + liveness_probe {
                          + failure_threshold = 6
                          + period_seconds    = 10
                          + success_threshold = 1
                          + timeout_seconds   = 5

                          + http_get {
                              + path   = "/"
                              + port   = "8080"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 8080
                          + name           = "http"
                          + protocol       = "TCP"
                        }

                      + readiness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 5
                          + period_seconds        = 5
                          + success_threshold     = 1
                          + timeout_seconds       = 3

                          + http_get {
                              + path   = "/"
                              + port   = "8080"
                              + scheme = "HTTP"
                            }
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "70m"
                              + "memory" = "96Mi"
                            }
                          + requests = {
                              + "cpu"    = "50m"
                              + "memory" = "64Mi"
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = false
                          + privileged                 = false
                          + read_only_root_filesystem  = false
                          + run_as_non_root            = false

                          + capabilities {
                              + drop = [
                                  + "NET_RAW",
                                ]
                            }
                        }
                    }

                  + image_pull_secrets {
                      + name = "dockerhub"
                    }
                }
            }
        }
    }

  # module.k6-bin.kubernetes_ingress_v1.ingress_k6test will be created
  + resource "kubernetes_ingress_v1" "ingress_k6test" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "k6-php"
          + namespace        = "play-backends"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "nginx"

          + rule {
              + host = "k6-php.grafana.fun"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "k6-php"

                              + port {
                                  + number = 8080
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.k6-bin.kubernetes_service.service_k6test will be created
  + resource "kubernetes_service" "service_k6test" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "k6-php"
            }
          + name             = "k6-php"
          + namespace        = "play-backends"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "k6-php"
            }
          + session_affinity                  = "None"
          + type                              = "ClusterIP"

          + port {
              + node_port   = (known after apply)
              + port        = 8080
              + protocol    = "TCP"
              + target_port = "8080"
            }
        }
    }

  # module.k6-bin.kubernetes_service_account_v1.service_account_k6 will be created
  + resource "kubernetes_service_account_v1" "service_account_k6" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + image_pull_secret {
          + name = "dockerhub"
        }

      + metadata {
          + generation       = (known after apply)
          + name             = "k6-php"
          + namespace        = "play-backends"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.k6-http.kubernetes_deployment.deployment_httpbin will be created
  + resource "kubernetes_deployment" "deployment_httpbin" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "k6-http"
            }
          + name             = "k6-http"
          + namespace        = "play-backends"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "4"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "k6-http"
                }
            }

          + strategy {
              + type = "Recreate"
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "k6-http"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = "test-k6-io"
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "grafana/k6-httpbin:v0.7.3"
                      + image_pull_policy          = "IfNotPresent"
                      + name                       = "k6-http"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + liveness_probe {
                          + failure_threshold = 6
                          + period_seconds    = 10
                          + success_threshold = 1
                          + timeout_seconds   = 5

                          + http_get {
                              + path   = "/"
                              + port   = "8080"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 8080
                          + name           = "http"
                          + protocol       = "TCP"
                        }

                      + readiness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 5
                          + period_seconds        = 5
                          + success_threshold     = 1
                          + timeout_seconds       = 3

                          + http_get {
                              + path   = "/"
                              + port   = "8080"
                              + scheme = "HTTP"
                            }
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "70m"
                              + "memory" = "96Mi"
                            }
                          + requests = {
                              + "cpu"    = "50m"
                              + "memory" = "64Mi"
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = false
                          + privileged                 = false
                          + read_only_root_filesystem  = false
                          + run_as_non_root            = true
                          + run_as_user                = "1000"

                          + capabilities {
                              + drop = [
                                  + "NET_RAW",
                                ]
                            }
                        }
                    }

                  + image_pull_secrets {
                      + name = "dockerhub"
                    }
                }
            }
        }
    }

  # module.k6-http.kubernetes_ingress_v1.ingress_httpbin will be created
  + resource "kubernetes_ingress_v1" "ingress_httpbin" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "k6-http"
          + namespace        = "play-backends"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "nginx"

          + rule {
              + host = "k6-http.grafana.fun"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "k6-http"

                              + port {
                                  + number = 8080
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.k6-http.kubernetes_service.service_httpbin will be created
  + resource "kubernetes_service" "service_httpbin" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "k6-http"
            }
          + name             = "k6-http"
          + namespace        = "play-backends"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "k6-http"
            }
          + session_affinity                  = "None"
          + type                              = "ClusterIP"

          + port {
              + node_port   = (known after apply)
              + port        = 8080
              + protocol    = "TCP"
              + target_port = "8080"
            }
        }
    }

  # module.k6-test.kubernetes_deployment.deployment_k6test will be destroyed
  # (because kubernetes_deployment.deployment_k6test is not in configuration)
  - resource "kubernetes_deployment" "deployment_k6test" {
      - id               = "play-backends/test-k6-io" -> null
      - wait_for_rollout = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 1 -> null
          - labels           = {
              - "app" = "test-k6-io"
            } -> null
          - name             = "test-k6-io" -> null
          - namespace        = "play-backends" -> null
          - resource_version = "75516766" -> null
          - uid              = "7f003aa2-573a-47c1-88a0-9574dc296ab9" -> null
        }

      - spec {
          - min_ready_seconds         = 0 -> null
          - paused                    = false -> null
          - progress_deadline_seconds = 600 -> null
          - replicas                  = "2" -> null
          - revision_history_limit    = 10 -> null

          - selector {
              - match_labels = {
                  - "app" = "test-k6-io"
                } -> null
            }

          - strategy {
              - type = "Recreate" -> null
            }

          - template {
              - metadata {
                  - annotations = {} -> null
                  - generation  = 0 -> null
                  - labels      = {
                      - "app" = "test-k6-io"
                    } -> null
                }
              - spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = true -> null
                  - dns_policy                       = "ClusterFirst" -> null
                  - enable_service_links             = true -> null
                  - host_ipc                         = false -> null
                  - host_network                     = false -> null
                  - host_pid                         = false -> null
                  - node_selector                    = {} -> null
                  - restart_policy                   = "Always" -> null
                  - scheduler_name                   = "default-scheduler" -> null
                  - service_account_name             = "test-k6-io" -> null
                  - share_process_namespace          = false -> null
                  - termination_grace_period_seconds = 30 -> null

                  - container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      - image                      = "grafana/test.k6.io:v0.0.3" -> null
                      - image_pull_policy          = "IfNotPresent" -> null
                      - name                       = "test-k6-io" -> null
                      - stdin                      = false -> null
                      - stdin_once                 = false -> null
                      - termination_message_path   = "/dev/termination-log" -> null
                      - termination_message_policy = "File" -> null
                      - tty                        = false -> null

                      - liveness_probe {
                          - failure_threshold     = 6 -> null
                          - initial_delay_seconds = 0 -> null
                          - period_seconds        = 10 -> null
                          - success_threshold     = 1 -> null
                          - timeout_seconds       = 5 -> null

                          - http_get {
                              - path   = "/" -> null
                              - port   = "8080" -> null
                              - scheme = "HTTP" -> null
                            }
                        }

                      - port {
                          - container_port = 8080 -> null
                          - host_port      = 0 -> null
                          - name           = "http" -> null
                          - protocol       = "TCP" -> null
                        }

                      - readiness_probe {
                          - failure_threshold     = 3 -> null
                          - initial_delay_seconds = 5 -> null
                          - period_seconds        = 5 -> null
                          - success_threshold     = 1 -> null
                          - timeout_seconds       = 3 -> null

                          - http_get {
                              - path   = "/" -> null
                              - port   = "8080" -> null
                              - scheme = "HTTP" -> null
                            }
                        }

                      - resources {
                          - limits   = {
                              - "cpu"    = "70m"
                              - "memory" = "96Mi"
                            } -> null
                          - requests = {
                              - "cpu"    = "50m"
                              - "memory" = "64Mi"
                            } -> null
                        }

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }
                    }

                  - image_pull_secrets {
                      - name = "dockerhub" -> null
                    }
                }
            }
        }
    }

  # module.k6-test.kubernetes_ingress_v1.ingress_k6test will be destroyed
  # (because kubernetes_ingress_v1.ingress_k6test is not in configuration)
  - resource "kubernetes_ingress_v1" "ingress_k6test" {
      - id     = "play-backends/test-k6-io" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = ""
                              - ip       = "34.133.192.185"
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "test-k6-io" -> null
          - namespace        = "play-backends" -> null
          - resource_version = "75510889" -> null
          - uid              = "ece1a0fa-8e61-4266-8c43-93a16de94dbe" -> null
        }

      - spec {
          - ingress_class_name = "nginx" -> null

          - rule {
              - host = "k6.grafana.fun" -> null

              - http {
                  - path {
                      - path      = "/" -> null
                      - path_type = "Prefix" -> null

                      - backend {
                          - service {
                              - name = "test-k6-io" -> null

                              - port {
                                  - number = 8080 -> null
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.k6-test.kubernetes_service.service_k6test will be destroyed
  # (because kubernetes_service.service_k6test is not in configuration)
  - resource "kubernetes_service" "service_k6test" {
      - id                     = "play-backends/test-k6-io" -> null
      - status                 = [
          - {
              - load_balancer = [
                  - {
                      - ingress = []
                    },
                ]
            },
        ] -> null
      - wait_for_load_balancer = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {
              - "app" = "test-k6-io"
            } -> null
          - name             = "test-k6-io" -> null
          - namespace        = "play-backends" -> null
          - resource_version = "75510880" -> null
          - uid              = "6cb7fe92-59da-477a-916f-1cf778417bff" -> null
        }

      - spec {
          - allocate_load_balancer_node_ports = true -> null
          - cluster_ip                        = "10.7.243.153" -> null
          - cluster_ips                       = [
              - "10.7.243.153",
            ] -> null
          - external_ips                      = [] -> null
          - health_check_node_port            = 0 -> null
          - internal_traffic_policy           = "Cluster" -> null
          - ip_families                       = [
              - "IPv4",
            ] -> null
          - ip_family_policy                  = "SingleStack" -> null
          - load_balancer_source_ranges       = [] -> null
          - publish_not_ready_addresses       = false -> null
          - selector                          = {
              - "app" = "test-k6-io"
            } -> null
          - session_affinity                  = "None" -> null
          - type                              = "ClusterIP" -> null

          - port {
              - node_port   = 0 -> null
              - port        = 8080 -> null
              - protocol    = "TCP" -> null
              - target_port = "8080" -> null
            }
        }
    }

  # module.k6-test.kubernetes_service_account_v1.service_account_k6 will be destroyed
  # (because kubernetes_service_account_v1.service_account_k6 is not in configuration)
  - resource "kubernetes_service_account_v1" "service_account_k6" {
      - automount_service_account_token = true -> null
      - id                              = "play-backends/test-k6-io" -> null

      - image_pull_secret {
          - name = "dockerhub" -> null
        }

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "test-k6-io" -> null
          - namespace        = "play-backends" -> null
          - resource_version = "75516403" -> null
          - uid              = "87faea96-0351-4da6-a8cb-7248e927f159" -> null
        }
    }

Plan: 7 to add, 0 to change, 7 to destroy.

Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```